yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/Documents/СК_Перемещение/СК_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СК_Перемещение</name>
  <registerRecords>AccumulationRegister.СК_ТоварыНаСкладах</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.СК_Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПриемник</name>
      <type>
        <types>CatalogRef.СК_Ячейки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ФормаПеремещения/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ШКНоменклатурыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ПоискНоменклатурыШК(Текст);  
	Если ЭтаФорма.Номенклатура <> "" Тогда
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискШКЯчейки();
		//ПодключитьОбработчикОжидания("АктивироватьПоискШКЯчейки",5,Истина);
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура ПоискНоменклатурыШК(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();

	/////////////////
		ШКНоменклатуры = "";
		ШКЯчейки = "";
		ШКЯчейкиПолучатель = "";
		ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
		ЭтаФорма.ЯчейкаПолучатель = Справочники.СК_Ячейки.ПустаяСсылка();
/////////////////

	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;
	Иначе 
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Номенклатура не найдена";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Ячейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.ШтрихКод = &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Ячейка = Рез[0].Ссылка; 
		ПроверитьНайтиКоличество();
		//ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "";
	Иначе 
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "Ячейка не найдена";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНайтиКоличество()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка"; 
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.Вналичии = Рез.Итог("ВналичииОстаток"); 
		ЭтаФорма.Элементы.Вналичии.Доступность = Истина;
		ЭтаФорма.Элементы.ГруппаПриемник.Доступность = Истина;
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейкиПолучатель;
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "";
	Иначе
		ЭтаФорма.Элементы.ГруппаПриемник.Доступность = Ложь;
		ЭтаФорма.Вналичии = 0 ; 
		ЭтаФорма.Элементы.Вналичии.Доступность = Ложь;
		ЭтаФорма.Элементы.ОшибкаЯчейка.Заголовок = "В ячейке нет товара";
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры


&НаСервере
Функция ПроверитьКоличество()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка"; 
	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
    	Возврат Рез.Итог("ВналичииОстаток");
	Иначе
		Возврат 0;	
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция ПереместитьНаСервере()
	К = ПроверитьКоличество();
	Если ЭтаФорма.Номенклатура.Ссылка.Пустая() =  Ложь И 
		ЭтаФорма.Ячейка.Ссылка.Пустая() = Ложь И 
		ЭтаФорма.ЯчейкаПолучатель.Ссылка.Пустая() = Ложь И 
		ЭтаФорма.Вналичии <=К Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СК_Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СК_Перемещение КАК СК_Перемещение
		|ГДЕ
		|	СК_Перемещение.ПометкаУдаления = &ПометкаУдаления
		|	И СК_Перемещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СК_Перемещение.Проведен = &Проведен"; 
		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);  
		Запрос.УстановитьПараметр("Проведен", Истина);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			ТекДок = Рез.Ссылка.ПолучитьОбъект();
		Иначе
			ТекДок = Документы.СК_Перемещение.СоздатьДокумент(); 
			ТекДок.Дата =ТекущаяДата(); 
		КонецЕсли;
		НоваяСтрока = ТекДок.Товары.Добавить();
		НоваяСтрока.Номенклатура = ЭтаФорма.Номенклатура;

		НоваяСтрока.Количество = ЭтаФорма.Вналичии;
		НоваяСтрока.Время = ТекущаяДата(); 
		НоваяСтрока.ЯчейкаОтправитель = ЭтаФорма.Ячейка;;
		НоваяСтрока.ЯчейкаПриемник = ЭтаФорма.ЯчейкаПолучатель;;
		
		Попытка
			ТекДок.Записать(РежимЗаписиДокумента.Проведение); 
			Возврат Истина;
		Исключение
			Возврат Ложь;
		Конецпопытки;	
		  
		
	Иначе 
		ЭтаФорма.Элементы.ОшибкаНом.Заголовок = "Проверьте все поля и количество";
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура Переместить(Команда)
	О = ПереместитьНаСервере();
	Если О = Истина Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиПолучательИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКЯчейкиПолучательИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры  

&НаСервере
Процедура ШКЯчейкиПолучательИзменениеТекстаРедактированияНаСервере(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Ячейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СК_Ячейки КАК СК_Ячейки
	               |ГДЕ
	               |	СК_Ячейки.ШтрихКод = &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()=1 Тогда
		ЭтаФорма.ЯчейкаПолучатель = Рез[0].Ссылка; 
		ЭтаФорма.Элементы.ОшибкаЯчейка1.Заголовок = ""; 
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Вналичии;
	Иначе 
		ЭтаФорма.ЯчейкаПолучатель = Справочники.СК_Ячейки.ПустаяСсылка();
		ЭтаФорма.Элементы.ОшибкаЯчейка1.Заголовок = "Ячейка не найдена";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКНоменклатуры.РедактированиеТекста = Истина;
	АктивироватьПоиск();
	//ПодключитьОбработчикОжидания("АктивироватьПоиск",5,Истина);

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКНоменклатуры.ОбновитьТекстРедактирования();
	Элементы.ШКНоменклатуры.Видимость = Ложь;
	Элементы.ШКНоменклатуры.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКНоменклатуры; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКНоменклатуры = "";
КонецПроцедуры  

/////

&НаКлиенте
Процедура АктивироватьПоискШКЯчейки() 
	ОчиститьШКСерверШКЯчейки(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСерверШКЯчейки()
	ШКЯчейки = "";
КонецПроцедуры
